#control flow 3 components 1-statement - რომლებიც შესრულებია 
# 2- expression რომლებიც ფასდება 
#3- declaration რომლებიც დამუშავებულია 
 

#რა არის იტერაცია - იდენტური ან მსგავსი ამოცანების გამეორება შეცდომების გარეშე არის ის რაც კომპიუტერები კარგად აკეთებენ და ადამიანები ცუდად 
#განცხადების სიმრავლის განმეორებით შესრულებას იტერაცია ეწოდება იმის გამო რომ გამეორება ძალიან გავრცელებულია პითონი უზრუნველყოფ რამდენიმე ენობრივ ფუნქციას რათა გააადვილდეს 


sum = 0  # ცვლადი, სადაც ჯამი შეინახება

for i in range(1, 10):  # ციკლი 1-დან 10-მდე 
    sum += i  # ყოველ ჯერზე მიმდინარე რიცხვს ვუმატებთ ჯამს

print("total:", sum) 






#for i in range(2, 21):



 


